#### Terraform Plan: ✅

<details>
<summary>Show</summary>

```terraform
[command]/home/runner/work/_temp/6e17cee2-7fb9-418f-8045-dfd8188719a7/terraform-bin plan -input=false
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/cey5wq-dev/runs/run-hAWTadNKgHt3ELae

Waiting for the plan to start...

Terraform v1.1.9
on linux_amd64
Initializing plugins and modules...
random_integer.cf_origin_id: Refreshing state... [id=2]
random_pet.upload_bucket_name: Refreshing state... [id=upload-bucket-easy-longhorn]
aws_iam_role.sample_app_container_role: Refreshing state... [id=sample_app_container_role]
aws_sns_topic.billing_alert_topic: Refreshing state... [id=arn:aws:sns:ca-central-1:750307557100:startup-sample-billing-alert-topic]
aws_dynamodb_table.startup_sample_table: Refreshing state... [id=ssp-greetings]
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ca-central-1:750307557100:cluster/sample-cluster]
aws_cloudfront_distribution.geofencing[0]: Refreshing state... [id=E2V9IG3QAA0ZBA]
aws_s3_bucket.upload_bucket: Refreshing state... [id=upload-bucket-easy-longhorn]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole]
aws_budgets_budget.cost: Refreshing state... [id=750307557100:startup-sample-monthly]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-0d08b3e5d27504d2e]
aws_alb_target_group.app: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:750307557100:targetgroup/sample-target-group/e3d83ce273e376e7]
aws_lb_listener_rule.host_based_weighted_routing: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:750307557100:listener-rule/app/default/0c809176c7c1df62/4fe72b37b89fbe83/61da53327c562b23]
aws_iam_role_policy.sample_app_container_cwlogs: Refreshing state... [id=sample_app_container_role:sample_app_container_cwlogs]
aws_iam_role_policy.sample_app_dynamodb: Refreshing state... [id=sample_app_container_role:sample_app_dynamodb]
aws_iam_role_policy.ssp_bucket_policy: Refreshing state... [id=sample_app_container_role:upload_bucket_policy]
aws_iam_role_policy.ecs_task_execution_cwlogs: Refreshing state... [id=startupSampleEcsTaskExecutionRole:ecs_task_execution_cwlogs]
aws_iam_role_policy_attachment.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole-20220712182416110200000002]
aws_ecs_task_definition.app[0]: Refreshing state... [id=sample-app-task]
aws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:ca-central-1:750307557100:service/sample-cluster/sample-service]
aws_appautoscaling_target.target[0]: Refreshing state... [id=service/sample-cluster/sample-service]
aws_appautoscaling_policy.up[0]: Refreshing state... [id=sample_scale_up]
aws_appautoscaling_policy.down[0]: Refreshing state... [id=sample_scale_down]
aws_cloudwatch_metric_alarm.service_cpu_high[0]: Refreshing state... [id=sample_cpu_utilization_high]
aws_cloudwatch_metric_alarm.service_cpu_low[0]: Refreshing state... [id=sample_cpu_utilization_low]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_appautoscaling_policy.down[0] has been deleted
  - resource "aws_appautoscaling_policy" "down" {
      - arn                = "arn:aws:autoscaling:ca-central-1:750307557100:scalingPolicy:1171a12f-0612-4729-9011-c8993da2b02d:resource/ecs/service/sample-cluster/sample-service:policyName/sample_scale_down" -> null
      - id                 = "sample_scale_down" -> null
      - name               = "sample_scale_down" -> null
      - policy_type        = "StepScaling" -> null
      - resource_id        = "service/sample-cluster/sample-service" -> null
      - scalable_dimension = "ecs:service:DesiredCount" -> null
      - service_namespace  = "ecs" -> null

      - step_scaling_policy_configuration {
          - adjustment_type          = "ChangeInCapacity" -> null
          - cooldown                 = 60 -> null
          - metric_aggregation_type  = "Maximum" -> null
          - min_adjustment_magnitude = 0 -> null

          - step_adjustment {
              - metric_interval_upper_bound = "0" -> null
              - scaling_adjustment          = -1 -> null
            }
        }
    }

  # aws_appautoscaling_policy.up[0] has been deleted
  - resource "aws_appautoscaling_policy" "up" {
      - arn                = "arn:aws:autoscaling:ca-central-1:750307557100:scalingPolicy:1171a12f-0612-4729-9011-c8993da2b02d:resource/ecs/service/sample-cluster/sample-service:policyName/sample_scale_up" -> null
      - id                 = "sample_scale_up" -> null
      - name               = "sample_scale_up" -> null
      - policy_type        = "StepScaling" -> null
      - resource_id        = "service/sample-cluster/sample-service" -> null
      - scalable_dimension = "ecs:service:DesiredCount" -> null
      - service_namespace  = "ecs" -> null

      - step_scaling_policy_configuration {
          - adjustment_type          = "ChangeInCapacity" -> null
          - cooldown                 = 60 -> null
          - metric_aggregation_type  = "Maximum" -> null
          - min_adjustment_magnitude = 0 -> null

          - step_adjustment {
              - metric_interval_lower_bound = "0" -> null
              - scaling_adjustment          = 1 -> null
            }
        }
    }

  # aws_appautoscaling_target.target[0] has been deleted
  - resource "aws_appautoscaling_target" "target" {
      - id                 = "service/sample-cluster/sample-service" -> null
      - max_capacity       = 6 -> null
      - min_capacity       = 1 -> null
      - resource_id        = "service/sample-cluster/sample-service" -> null
      - role_arn           = "arn:aws:iam::750307557100:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> null
      - scalable_dimension = "ecs:service:DesiredCount" -> null
      - service_namespace  = "ecs" -> null
    }

  # aws_cloudfront_distribution.geofencing[0] has changed
  ~ resource "aws_cloudfront_distribution" "geofencing" {
      + aliases                        = []
        id                             = "E2V9IG3QAA0ZBA"
        tags                           = {
            "Application" = "Startup Sample"
        }
        # (18 unchanged attributes hidden)


      ~ ordered_cache_behavior {
          + trusted_key_groups     = []
          + trusted_signers        = []
            # (10 unchanged attributes hidden)

          ~ forwarded_values {
                # (3 unchanged attributes hidden)

              ~ cookies {
                  + whitelisted_names = []
                    # (1 unchanged attribute hidden)
                }
            }
        }



        # (4 unchanged blocks hidden)
    }

  # aws_cloudwatch_metric_alarm.service_cpu_high[0] has changed
  ~ resource "aws_cloudwatch_metric_alarm" "service_cpu_high" {
      ~ alarm_actions             = [
          - "arn:aws:autoscaling:ca-central-1:750307557100:scalingPolicy:1171a12f-0612-4729-9011-c8993da2b02d:resource/ecs/service/sample-cluster/sample-service:policyName/sample_scale_up",
        ]
        id                        = "sample_cpu_utilization_high"
      + insufficient_data_actions = []
      + ok_actions                = []
        tags                      = {
            "Application" = "Startup Sample"
        }
        # (14 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.service_cpu_low[0] has changed
  ~ resource "aws_cloudwatch_metric_alarm" "service_cpu_low" {
      ~ alarm_actions             = [
          - "arn:aws:autoscaling:ca-central-1:750307557100:scalingPolicy:1171a12f-0612-4729-9011-c8993da2b02d:resource/ecs/service/sample-cluster/sample-service:policyName/sample_scale_down",
        ]
        id                        = "sample_cpu_utilization_low"
      + insufficient_data_actions = []
      + ok_actions                = []
        tags                      = {
            "Application" = "Startup Sample"
        }
        # (14 unchanged attributes hidden)
    }

  # aws_ecs_cluster.main has been deleted
  - resource "aws_ecs_cluster" "main" {
      - arn                = "arn:aws:ecs:ca-central-1:750307557100:cluster/sample-cluster" -> null
      - capacity_providers = [
          - "FARGATE_SPOT",
        ] -> null
      - id                 = "arn:aws:ecs:ca-central-1:750307557100:cluster/sample-cluster" -> null
      - name               = "sample-cluster" -> null
      - tags               = {
          - "Application" = "Startup Sample"
        } -> null
      - tags_all           = {
          - "Application" = "Startup Sample"
        } -> null

      - default_capacity_provider_strategy {
          - capacity_provider = "FARGATE_SPOT" -> null
          - weight            = 100 -> null
        }

      - setting {
          - name  = "containerInsights" -> null
          - value = "disabled" -> null
        }
    }

  # aws_ecs_service.main[0] has been deleted
  - resource "aws_ecs_service" "main" {
      - cluster                            = "arn:aws:ecs:ca-central-1:750307557100:cluster/sample-cluster" -> null
      - deployment_maximum_percent         = 200 -> null
      - deployment_minimum_healthy_percent = 100 -> null
      - desired_count                      = 2 -> null
      - enable_ecs_managed_tags            = true -> null
      - enable_execute_command             = false -> null
      - health_check_grace_period_seconds  = 60 -> null
      - iam_role                           = "aws-service-role" -> null
      - id                                 = "arn:aws:ecs:ca-central-1:750307557100:service/sample-cluster/sample-service" -> null
      - name                               = "sample-service" -> null
      - platform_version                   = "LATEST" -> null
      - propagate_tags                     = "TASK_DEFINITION" -> null
      - scheduling_strategy                = "REPLICA" -> null
      - tags                               = {
          - "Application" = "Startup Sample"
        } -> null
      - tags_all                           = {
          - "Application" = "Startup Sample"
        } -> null
      - task_definition                    = "arn:aws:ecs:ca-central-1:750307557100:task-definition/sample-app-task:2" -> null
      - wait_for_steady_state              = false -> null

      - capacity_provider_strategy {
          - capacity_provider = "FARGATE_SPOT" -> null
          - weight            = 100 -> null
        }

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }

      - load_balancer {
          - container_name   = "sample-client-app" -> null
          - container_port   = 80 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:750307557100:targetgroup/sample-target-group/e3d83ce273e376e7" -> null
        }

      - network_configuration {
          - assign_public_ip = false -> null
          - security_groups  = [
              - "sg-0d08b3e5d27504d2e",
            ] -> null
          - subnets          = [
              - "subnet-048e25be105ae01d3",
              - "subnet-0896ff158c3ecdc53",
            ] -> null
        }
    }

  # aws_ecs_task_definition.app[0] has been deleted
  - resource "aws_ecs_task_definition" "app" {
      - arn                      = "arn:aws:ecs:ca-central-1:750307557100:task-definition/sample-app-task:2" -> null
      - container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 512
                  - environment      = [
                      - {
                          - name  = "AWS_REGION"
                          - value = "ca-central-1"
                        },
                      - {
                          - name  = "DB_NAME"
                          - value = "ssp-greetings"
                        },
                      - {
                          - name  = "bucketName"
                          - value = "upload-bucket-easy-longhorn"
                        },
                    ]
                  - essential        = true
                  - image            = "646101433301.dkr.ecr.ca-central-1.amazonaws.com/ssp:d46a1d09713ee116abb6dc183c37a3af330218df"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-create-group  = "true"
                          - awslogs-group         = "/ecs/sample-app"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - memory           = 1024
                  - mountPoints      = []
                  - name             = "sample-client-app"
                  - portMappings     = [
                      - {
                          - containerPort = 80
                          - hostPort      = 80
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> null
      - cpu                      = "512" -> null
      - execution_role_arn       = "arn:aws:iam::750307557100:role/startupSampleEcsTaskExecutionRole" -> null
      - family                   = "sample-app-task" -> null
      - id                       = "sample-app-task" -> null
      - memory                   = "1024" -> null
      - network_mode             = "awsvpc" -> null
      - requires_compatibilities = [
          - "FARGATE",
        ] -> null
      - revision                 = 2 -> null
      - skip_destroy             = false -> null
      - tags                     = {
          - "Application" = "Startup Sample"
        } -> null
      - tags_all                 = {
          - "Application" = "Startup Sample"
        } -> null
      - task_role_arn            = "arn:aws:iam::750307557100:role/sample_app_container_role" -> null
    }

  # aws_iam_role.ecs_task_execution_role has changed
  ~ resource "aws_iam_role" "ecs_task_execution_role" {
        id                    = "startupSampleEcsTaskExecutionRole"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ]
        name                  = "startupSampleEcsTaskExecutionRole"
        tags                  = {
            "Application" = "Startup Sample"
        }
        # (8 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + name   = "ecs_task_execution_cwlogs"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "logs:CreateLogGroup",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:logs:*:*:*",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # aws_iam_role.sample_app_container_role has changed
  ~ resource "aws_iam_role" "sample_app_container_role" {
        id                    = "sample_app_container_role"
        name                  = "sample_app_container_role"
        tags                  = {
            "Application" = "Startup Sample"
        }
        # (9 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + name   = "sample_app_container_cwlogs"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "logs:CreateLogGroup",
                              + "logs:CreateLogStream",
                              + "logs:PutLogEvents",
                              + "logs:DescribeLogStreams",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:logs:*:*:*",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
      + inline_policy {
          + name   = "sample_app_dynamodb"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "dynamodb:BatchGet*",
                              + "dynamodb:DescribeStream",
                              + "dynamodb:DescribeTable",
                              + "dynamodb:Get*",
                              + "dynamodb:Query",
                              + "dynamodb:Scan",
                              + "dynamodb:BatchWrite*",
                              + "dynamodb:CreateTable",
                              + "dynamodb:Delete*",
                              + "dynamodb:Update*",
                              + "dynamodb:PutItem",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:dynamodb:ca-central-1:750307557100:table/ssp-greetings"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
      + inline_policy {
          + name   = "upload_bucket_policy"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "s3:PutObject",
                              + "s3:GetObject",
                              + "kms:Decrypt",
                              + "kms:Encrypt",
                              + "s3:PutBucketCORS",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:s3:::upload-bucket-easy-longhorn",
                              + "arn:aws:s3:::upload-bucket-easy-longhorn/*",
                              + "arn:aws:kms:*:750307557100:key/*",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # aws_lb_listener_rule.host_based_weighted_routing has changed
  ~ resource "aws_lb_listener_rule" "host_based_weighted_routing" {
        id           = "arn:aws:elasticloadbalancing:ca-central-1:750307557100:listener-rule/app/default/0c809176c7c1df62/4fe72b37b89fbe83/61da53327c562b23"
      + tags         = {}
        # (4 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket.upload_bucket has changed
  ~ resource "aws_s3_bucket" "upload_bucket" {
        id                          = "upload-bucket-easy-longhorn"
      + tags                        = {}
        # (11 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_sns_topic.billing_alert_topic has changed
  ~ resource "aws_sns_topic" "billing_alert_topic" {
        id                                       = "arn:aws:sns:ca-central-1:750307557100:startup-sample-billing-alert-topic"
        name                                     = "startup-sample-billing-alert-topic"
      + tags                                     = {}
        # (11 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_appautoscaling_policy.down[0] will be created
  + resource "aws_appautoscaling_policy" "down" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "sample_scale_down"
      + policy_type        = "StepScaling"
      + resource_id        = "service/sample-cluster/sample-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Maximum"

          + step_adjustment {
              + metric_interval_upper_bound = "0"
              + scaling_adjustment          = -1
            }
        }
    }

  # aws_appautoscaling_policy.up[0] will be created
  + resource "aws_appautoscaling_policy" "up" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "sample_scale_up"
      + policy_type        = "StepScaling"
      + resource_id        = "service/sample-cluster/sample-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Maximum"

          + step_adjustment {
              + metric_interval_lower_bound = "0"
              + scaling_adjustment          = 1
            }
        }
    }

  # aws_appautoscaling_target.target[0] will be created
  + resource "aws_appautoscaling_target" "target" {
      + id                 = (known after apply)
      + max_capacity       = 6
      + min_capacity       = 1
      + resource_id        = "service/sample-cluster/sample-service"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
    }

  # aws_budgets_budget.cost will be updated in-place
  ~ resource "aws_budgets_budget" "cost" {
        id                = "750307557100:startup-sample-monthly"
        name              = "startup-sample-monthly"
      ~ time_period_start = "2022-07-01_12:00" -> (known after apply)
        # (8 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_cloudwatch_metric_alarm.service_cpu_high[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "service_cpu_high" {
      ~ alarm_actions             = [] -> (known after apply)
        id                        = "sample_cpu_utilization_high"
        tags                      = {
            "Application" = "Startup Sample"
        }
        # (16 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.service_cpu_low[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "service_cpu_low" {
      ~ alarm_actions             = [] -> (known after apply)
        id                        = "sample_cpu_utilization_low"
        tags                      = {
            "Application" = "Startup Sample"
        }
        # (16 unchanged attributes hidden)
    }

  # aws_ecs_cluster.main will be created
  + resource "aws_ecs_cluster" "main" {
      + arn                = (known after apply)
      + capacity_providers = [
          + "FARGATE_SPOT",
        ]
      + id                 = (known after apply)
      + name               = "sample-cluster"
      + tags               = {
          + "Application" = "Startup Sample"
        }
      + tags_all           = {
          + "Application" = "Startup Sample"
        }

      + default_capacity_provider_strategy {
          + capacity_provider = "FARGATE_SPOT"
          + weight            = 100
        }

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # aws_ecs_service.main[0] will be created
  + resource "aws_ecs_service" "main" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = true
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 60
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = (known after apply)
      + name                               = "sample-service"
      + platform_version                   = (known after apply)
      + propagate_tags                     = "TASK_DEFINITION"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Application" = "Startup Sample"
        }
      + tags_all                           = {
          + "Application" = "Startup Sample"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + capacity_provider_strategy {
          + capacity_provider = "FARGATE_SPOT"
          + weight            = 100
        }

      + load_balancer {
          + container_name   = "sample-client-app"
          + container_port   = 80
          + target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:750307557100:targetgroup/sample-target-group/e3d83ce273e376e7"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0d08b3e5d27504d2e",
            ]
          + subnets          = [
              + "subnet-048e25be105ae01d3",
              + "subnet-0896ff158c3ecdc53",
            ]
        }
    }

  # aws_ecs_task_definition.app[0] will be created
  + resource "aws_ecs_task_definition" "app" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu              = 512
                  + environment      = [
                      + {
                          + name  = "AWS_REGION"
                          + value = "ca-central-1"
                        },
                      + {
                          + name  = "DB_NAME"
                          + value = "ssp-greetings"
                        },
                      + {
                          + name  = "bucketName"
                          + value = "upload-bucket-easy-longhorn"
                        },
                    ]
                  + essential        = true
                  + image            = "646101433301.dkr.ecr.ca-central-1.amazonaws.com/ssp:0f041e896cc2d18e5decf66ac4a020d4ffb8bd42"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-create-group  = "true"
                          + awslogs-group         = "/ecs/sample-app"
                          + awslogs-region        = "ca-central-1"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + memory           = 1024
                  + mountPoints      = []
                  + name             = "sample-client-app"
                  + portMappings     = [
                      + {
                          + containerPort = 80
                          + hostPort      = 80
                          + protocol      = "tcp"
                        },
                    ]
                  + volumesFrom      = []
                },
            ]
        )
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::750307557100:role/startupSampleEcsTaskExecutionRole"
      + family                   = "sample-app-task"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Application" = "Startup Sample"
        }
      + tags_all                 = {
          + "Application" = "Startup Sample"
        }
      + task_role_arn            = "arn:aws:iam::750307557100:role/sample_app_container_role"
    }

Plan: 6 to add, 3 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with aws_budgets_budget.cost,
│   on budget.tf line 19, in resource "aws_budgets_budget" "cost":
│   19:   cost_filters = {
│   20:     TagKeyValue = "user:Project$Startup Sample"
│   21:   }
│ 
│ Use the attribute "cost_filter" instead.
│ 
│ (and 7 more similar warnings elsewhere)
╵
╷
│ Warning: Deprecated Resource
│ 
│   with module.network.data.aws_subnet_ids.web,
│   on .terraform/modules/network/main.tf line 31, in data "aws_subnet_ids" "web":
│   31: data "aws_subnet_ids" "web" {
│ 
│ The aws_subnet_ids data source has been deprecated and will be removed in a
│ future version. Use the aws_subnets data source instead.
│ 
│ (and 5 more similar warnings elsewhere)
╵

------------------------------------------------------------------------

Cost estimation:

Resources: 3 of 5 estimated
           $1.180320000000000144/mo +$0.0
::debug::Terraform exited with code 0.
::debug::stdout: Running plan in the remote backend. Output will stream here. Pressing Ctrl-C%0Awill stop streaming the logs, but will not stop the plan running remotely.%0A%0APreparing the remote plan...%0A%0ATo view this run in a browser, visit:%0Ahttps://app.terraform.io/app/bcgov/cey5wq-dev/runs/run-hAWTadNKgHt3ELae%0A%0AWaiting for the plan to start...%0A%0ATerraform v1.1.9%0Aon linux_amd64%0AInitializing plugins and modules...%0Arandom_integer.cf_origin_id: Refreshing state... [id=2]%0Arandom_pet.upload_bucket_name: Refreshing state... [id=upload-bucket-easy-longhorn]%0Aaws_iam_role.sample_app_container_role: Refreshing state... [id=sample_app_container_role]%0Aaws_sns_topic.billing_alert_topic: Refreshing state... [id=arn:aws:sns:ca-central-1:750307557100:startup-sample-billing-alert-topic]%0Aaws_dynamodb_table.startup_sample_table: Refreshing state... [id=ssp-greetings]%0Aaws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ca-central-1:750307557100:cluster/sample-cluster]%0Aaws_cloudfront_distribution.geofencing[0]: Refreshing state... [id=E2V9IG3QAA0ZBA]%0Aaws_s3_bucket.upload_bucket: Refreshing state... [id=upload-bucket-easy-longhorn]%0Aaws_iam_role.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole]%0Aaws_budgets_budget.cost: Refreshing state... [id=750307557100:startup-sample-monthly]%0Aaws_security_group.ecs_tasks: Refreshing state... [id=sg-0d08b3e5d27504d2e]%0Aaws_alb_target_group.app: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:750307557100:targetgroup/sample-target-group/e3d83ce273e376e7]%0Aaws_lb_listener_rule.host_based_weighted_routing: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:750307557100:listener-rule/app/default/0c809176c7c1df62/4fe72b37b89fbe83/61da53327c562b23]%0Aaws_iam_role_policy.sample_app_container_cwlogs: Refreshing state... [id=sample_app_container_role:sample_app_container_cwlogs]%0Aaws_iam_role_policy.sample_app_dynamodb: Refreshing state... [id=sample_app_container_role:sample_app_dynamodb]%0Aaws_iam_role_policy.ssp_bucket_policy: Refreshing state... [id=sample_app_container_role:upload_bucket_policy]%0Aaws_iam_role_policy.ecs_task_execution_cwlogs: Refreshing state... [id=startupSampleEcsTaskExecutionRole:ecs_task_execution_cwlogs]%0Aaws_iam_role_policy_attachment.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole-20220712182416110200000002]%0Aaws_ecs_task_definition.app[0]: Refreshing state... [id=sample-app-task]%0Aaws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:ca-central-1:750307557100:service/sample-cluster/sample-service]%0Aaws_appautoscaling_target.target[0]: Refreshing state... [id=service/sample-cluster/sample-service]%0Aaws_appautoscaling_policy.up[0]: Refreshing state... [id=sample_scale_up]%0Aaws_appautoscaling_policy.down[0]: Refreshing state... [id=sample_scale_down]%0Aaws_cloudwatch_metric_alarm.service_cpu_high[0]: Refreshing state... [id=sample_cpu_utilization_high]%0Aaws_cloudwatch_metric_alarm.service_cpu_low[0]: Refreshing state... [id=sample_cpu_utilization_low]%0A%0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply":%0A%0A  # aws_appautoscaling_policy.down[0] has been deleted%0A  - resource "aws_appautoscaling_policy" "down" {%0A      - arn                = "arn:aws:autoscaling:ca-central-1:750307557100:scalingPolicy:1171a12f-0612-4729-9011-c8993da2b02d:resource/ecs/service/sample-cluster/sample-service:policyName/sample_scale_down" -> null%0A      - id                 = "sample_scale_down" -> null%0A      - name               = "sample_scale_down" -> null%0A      - policy_type        = "StepScaling" -> null%0A      - resource_id        = "service/sample-cluster/sample-service" -> null%0A      - scalable_dimension = "ecs:service:DesiredCount" -> null%0A      - service_namespace  = "ecs" -> null%0A%0A      - step_scaling_policy_configuration {%0A          - adjustment_type          = "ChangeInCapacity" -> null%0A          - cooldown                 = 60 -> null%0A          - metric_aggregation_type  = "Maximum" -> null%0A          - min_adjustment_magnitude = 0 -> null%0A%0A          - step_adjustment {%0A              - metric_interval_upper_bound = "0" -> null%0A              - scaling_adjustment          = -1 -> null%0A            }%0A        }%0A    }%0A%0A  # aws_appautoscaling_policy.up[0] has been deleted%0A  - resource "aws_appautoscaling_policy" "up" {%0A      - arn                = "arn:aws:autoscaling:ca-central-1:750307557100:scalingPolicy:1171a12f-0612-4729-9011-c8993da2b02d:resource/ecs/service/sample-cluster/sample-service:policyName/sample_scale_up" -> null%0A      - id                 = "sample_scale_up" -> null%0A      - name               = "sample_scale_up" -> null%0A      - policy_type        = "StepScaling" -> null%0A      - resource_id        = "service/sample-cluster/sample-service" -> null%0A      - scalable_dimension = "ecs:service:DesiredCount" -> null%0A      - service_namespace  = "ecs" -> null%0A%0A      - step_scaling_policy_configuration {%0A          - adjustment_type          = "ChangeInCapacity" -> null%0A          - cooldown                 = 60 -> null%0A          - metric_aggregation_type  = "Maximum" -> null%0A          - min_adjustment_magnitude = 0 -> null%0A%0A          - step_adjustment {%0A              - metric_interval_lower_bound = "0" -> null%0A              - scaling_adjustment          = 1 -> null%0A            }%0A        }%0A    }%0A%0A  # aws_appautoscaling_target.target[0] has been deleted%0A  - resource "aws_appautoscaling_target" "target" {%0A      - id                 = "service/sample-cluster/sample-service" -> null%0A      - max_capacity       = 6 -> null%0A      - min_capacity       = 1 -> null%0A      - resource_id        = "service/sample-cluster/sample-service" -> null%0A      - role_arn           = "arn:aws:iam::750307557100:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> null%0A      - scalable_dimension = "ecs:service:DesiredCount" -> null%0A      - service_namespace  = "ecs" -> null%0A    }%0A%0A  # aws_cloudfront_distribution.geofencing[0] has changed%0A  ~ resource "aws_cloudfront_distribution" "geofencing" {%0A      + aliases                        = []%0A        id                             = "E2V9IG3QAA0ZBA"%0A        tags                           = {%0A            "Application" = "Startup Sample"%0A        }%0A        # (18 unchanged attributes hidden)%0A%0A%0A      ~ ordered_cache_behavior {%0A          + trusted_key_groups     = []%0A          + trusted_signers        = []%0A            # (10 unchanged attributes hidden)%0A%0A          ~ forwarded_values {%0A                # (3 unchanged attributes hidden)%0A%0A              ~ cookies {%0A                  + whitelisted_names = []%0A                    # (1 unchanged attribute hidden)%0A                }%0A            }%0A        }%0A%0A%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # aws_cloudwatch_metric_alarm.service_cpu_high[0] has changed%0A  ~ resource "aws_cloudwatch_metric_alarm" "service_cpu_high" {%0A      ~ alarm_actions             = [%0A          - "arn:aws:autoscaling:ca-central-1:750307557100:scalingPolicy:1171a12f-0612-4729-9011-c8993da2b02d:resource/ecs/service/sample-cluster/sample-service:policyName/sample_scale_up",%0A        ]%0A        id                        = "sample_cpu_utilization_high"%0A      + insufficient_data_actions = []%0A      + ok_actions                = []%0A        tags                      = {%0A            "Application" = "Startup Sample"%0A        }%0A        # (14 unchanged attributes hidden)%0A    }%0A%0A  # aws_cloudwatch_metric_alarm.service_cpu_low[0] has changed%0A  ~ resource "aws_cloudwatch_metric_alarm" "service_cpu_low" {%0A      ~ alarm_actions             = [%0A          - "arn:aws:autoscaling:ca-central-1:750307557100:scalingPolicy:1171a12f-0612-4729-9011-c8993da2b02d:resource/ecs/service/sample-cluster/sample-service:policyName/sample_scale_down",%0A        ]%0A        id                        = "sample_cpu_utilization_low"%0A      + insufficient_data_actions = []%0A      + ok_actions                = []%0A        tags                      = {%0A            "Application" = "Startup Sample"%0A        }%0A        # (14 unchanged attributes hidden)%0A    }%0A%0A  # aws_ecs_cluster.main has been deleted%0A  - resource "aws_ecs_cluster" "main" {%0A      - arn                = "arn:aws:ecs:ca-central-1:750307557100:cluster/sample-cluster" -> null%0A      - capacity_providers = [%0A          - "FARGATE_SPOT",%0A        ] -> null%0A      - id                 = "arn:aws:ecs:ca-central-1:750307557100:cluster/sample-cluster" -> null%0A      - name               = "sample-cluster" -> null%0A      - tags               = {%0A          - "Application" = "Startup Sample"%0A        } -> null%0A      - tags_all           = {%0A          - "Application" = "Startup Sample"%0A        } -> null%0A%0A      - default_capacity_provider_strategy {%0A          - capacity_provider = "FARGATE_SPOT" -> null%0A          - weight            = 100 -> null%0A        }%0A%0A      - setting {%0A          - name  = "containerInsights" -> null%0A          - value = "disabled" -> null%0A        }%0A    }%0A%0A  # aws_ecs_service.main[0] has been deleted%0A  - resource "aws_ecs_service" "main" {%0A      - cluster                            = "arn:aws:ecs:ca-central-1:750307557100:cluster/sample-cluster" -> null%0A      - deployment_maximum_percent         = 200 -> null%0A      - deployment_minimum_healthy_percent = 100 -> null%0A      - desired_count                      = 2 -> null%0A      - enable_ecs_managed_tags            = true -> null%0A      - enable_execute_command             = false -> null%0A      - health_check_grace_period_seconds  = 60 -> null%0A      - iam_role                           = "aws-service-role" -> null%0A      - id                                 = "arn:aws:ecs:ca-central-1:750307557100:service/sample-cluster/sample-service" -> null%0A      - name                               = "sample-service" -> null%0A      - platform_version                   = "LATEST" -> null%0A      - propagate_tags                     = "TASK_DEFINITION" -> null%0A      - scheduling_strategy                = "REPLICA" -> null%0A      - tags                               = {%0A          - "Application" = "Startup Sample"%0A        } -> null%0A      - tags_all                           = {%0A          - "Application" = "Startup Sample"%0A        } -> null%0A      - task_definition                    = "arn:aws:ecs:ca-central-1:750307557100:task-definition/sample-app-task:2" -> null%0A      - wait_for_steady_state              = false -> null%0A%0A      - capacity_provider_strategy {%0A          - capacity_provider = "FARGATE_SPOT" -> null%0A          - weight            = 100 -> null%0A        }%0A%0A      - deployment_circuit_breaker {%0A          - enable   = false -> null%0A          - rollback = false -> null%0A        }%0A%0A      - deployment_controller {%0A          - type = "ECS" -> null%0A        }%0A%0A      - load_balancer {%0A          - container_name   = "sample-client-app" -> null%0A          - container_port   = 80 -> null%0A          - target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:750307557100:targetgroup/sample-target-group/e3d83ce273e376e7" -> null%0A        }%0A%0A      - network_configuration {%0A          - assign_public_ip = false -> null%0A          - security_groups  = [%0A              - "sg-0d08b3e5d27504d2e",%0A            ] -> null%0A          - subnets          = [%0A              - "subnet-048e25be105ae01d3",%0A              - "subnet-0896ff158c3ecdc53",%0A            ] -> null%0A        }%0A    }%0A%0A  # aws_ecs_task_definition.app[0] has been deleted%0A  - resource "aws_ecs_task_definition" "app" {%0A      - arn                      = "arn:aws:ecs:ca-central-1:750307557100:task-definition/sample-app-task:2" -> null%0A      - container_definitions    = jsonencode(%0A            [%0A              - {%0A                  - cpu              = 512%0A                  - environment      = [%0A                      - {%0A                          - name  = "AWS_REGION"%0A                          - value = "ca-central-1"%0A                        },%0A                      - {%0A                          - name  = "DB_NAME"%0A                          - value = "ssp-greetings"%0A                        },%0A                      - {%0A                          - name  = "bucketName"%0A                          - value = "upload-bucket-easy-longhorn"%0A                        },%0A                    ]%0A                  - essential        = true%0A                  - image            = "646101433301.dkr.ecr.ca-central-1.amazonaws.com/ssp:d46a1d09713ee116abb6dc183c37a3af330218df"%0A                  - logConfiguration = {%0A                      - logDriver = "awslogs"%0A                      - options   = {%0A                          - awslogs-create-group  = "true"%0A                          - awslogs-group         = "/ecs/sample-app"%0A                          - awslogs-region        = "ca-central-1"%0A                          - awslogs-stream-prefix = "ecs"%0A                        }%0A                    }%0A                  - memory           = 1024%0A                  - mountPoints      = []%0A                  - name             = "sample-client-app"%0A                  - portMappings     = [%0A                      - {%0A                          - containerPort = 80%0A                          - hostPort      = 80%0A                          - protocol      = "tcp"%0A                        },%0A                    ]%0A                  - volumesFrom      = []%0A                },%0A            ]%0A        ) -> null%0A      - cpu                      = "512" -> null%0A      - execution_role_arn       = "arn:aws:iam::750307557100:role/startupSampleEcsTaskExecutionRole" -> null%0A      - family                   = "sample-app-task" -> null%0A      - id                       = "sample-app-task" -> null%0A      - memory                   = "1024" -> null%0A      - network_mode             = "awsvpc" -> null%0A      - requires_compatibilities = [%0A          - "FARGATE",%0A        ] -> null%0A      - revision                 = 2 -> null%0A      - skip_destroy             = false -> null%0A      - tags                     = {%0A          - "Application" = "Startup Sample"%0A        } -> null%0A      - tags_all                 = {%0A          - "Application" = "Startup Sample"%0A        } -> null%0A      - task_role_arn            = "arn:aws:iam::750307557100:role/sample_app_container_role" -> null%0A    }%0A%0A  # aws_iam_role.ecs_task_execution_role has changed%0A  ~ resource "aws_iam_role" "ecs_task_execution_role" {%0A        id                    = "startupSampleEcsTaskExecutionRole"%0A      ~ managed_policy_arns   = [%0A          + "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",%0A        ]%0A        name                  = "startupSampleEcsTaskExecutionRole"%0A        tags                  = {%0A            "Application" = "Startup Sample"%0A        }%0A        # (8 unchanged attributes hidden)%0A%0A      - inline_policy {}%0A      + inline_policy {%0A          + name   = "ecs_task_execution_cwlogs"%0A          + policy = jsonencode(%0A                {%0A                  + Statement = [%0A                      + {%0A                          + Action   = [%0A                              + "logs:CreateLogGroup",%0A                            ]%0A                          + Effect   = "Allow"%0A                          + Resource = [%0A                              + "arn:aws:logs:*:*:*",%0A                            ]%0A                        },%0A                    ]%0A                  + Version   = "2012-10-17"%0A                }%0A            )%0A        }%0A    }%0A%0A  # aws_iam_role.sample_app_container_role has changed%0A  ~ resource "aws_iam_role" "sample_app_container_role" {%0A        id                    = "sample_app_container_role"%0A        name                  = "sample_app_container_role"%0A        tags                  = {%0A            "Application" = "Startup Sample"%0A        }%0A        # (9 unchanged attributes hidden)%0A%0A      - inline_policy {}%0A      + inline_policy {%0A          + name   = "sample_app_container_cwlogs"%0A          + policy = jsonencode(%0A                {%0A                  + Statement = [%0A                      + {%0A                          + Action   = [%0A                              + "logs:CreateLogGroup",%0A                              + "logs:CreateLogStream",%0A                              + "logs:PutLogEvents",%0A                              + "logs:DescribeLogStreams",%0A                            ]%0A                          + Effect   = "Allow"%0A                          + Resource = [%0A                              + "arn:aws:logs:*:*:*",%0A                            ]%0A                        },%0A                    ]%0A                  + Version   = "2012-10-17"%0A                }%0A            )%0A        }%0A      + inline_policy {%0A          + name   = "sample_app_dynamodb"%0A          + policy = jsonencode(%0A                {%0A                  + Statement = [%0A                      + {%0A                          + Action   = [%0A                              + "dynamodb:BatchGet*",%0A                              + "dynamodb:DescribeStream",%0A                              + "dynamodb:DescribeTable",%0A                              + "dynamodb:Get*",%0A                              + "dynamodb:Query",%0A                              + "dynamodb:Scan",%0A                              + "dynamodb:BatchWrite*",%0A                              + "dynamodb:CreateTable",%0A                              + "dynamodb:Delete*",%0A                              + "dynamodb:Update*",%0A                              + "dynamodb:PutItem",%0A                            ]%0A                          + Effect   = "Allow"%0A                          + Resource = "arn:aws:dynamodb:ca-central-1:750307557100:table/ssp-greetings"%0A                        },%0A                    ]%0A                  + Version   = "2012-10-17"%0A                }%0A            )%0A        }%0A      + inline_policy {%0A          + name   = "upload_bucket_policy"%0A          + policy = jsonencode(%0A                {%0A                  + Statement = [%0A                      + {%0A                          + Action   = [%0A                              + "s3:PutObject",%0A                              + "s3:GetObject",%0A                              + "kms:Decrypt",%0A                              + "kms:Encrypt",%0A                              + "s3:PutBucketCORS",%0A                            ]%0A                          + Effect   = "Allow"%0A                          + Resource = [%0A                              + "arn:aws:s3:::upload-bucket-easy-longhorn",%0A                              + "arn:aws:s3:::upload-bucket-easy-longhorn/*",%0A                              + "arn:aws:kms:*:750307557100:key/*",%0A                            ]%0A                        },%0A                    ]%0A                  + Version   = "2012-10-17"%0A                }%0A            )%0A        }%0A    }%0A%0A  # aws_lb_listener_rule.host_based_weighted_routing has changed%0A  ~ resource "aws_lb_listener_rule" "host_based_weighted_routing" {%0A        id           = "arn:aws:elasticloadbalancing:ca-central-1:750307557100:listener-rule/app/default/0c809176c7c1df62/4fe72b37b89fbe83/61da53327c562b23"%0A      + tags         = {}%0A        # (4 unchanged attributes hidden)%0A%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # aws_s3_bucket.upload_bucket has changed%0A  ~ resource "aws_s3_bucket" "upload_bucket" {%0A        id                          = "upload-bucket-easy-longhorn"%0A      + tags                        = {}%0A        # (11 unchanged attributes hidden)%0A%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # aws_sns_topic.billing_alert_topic has changed%0A  ~ resource "aws_sns_topic" "billing_alert_topic" {%0A        id                                       = "arn:aws:sns:ca-central-1:750307557100:startup-sample-billing-alert-topic"%0A        name                                     = "startup-sample-billing-alert-topic"%0A      + tags                                     = {}%0A        # (11 unchanged attributes hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # aws_appautoscaling_policy.down[0] will be created%0A  + resource "aws_appautoscaling_policy" "down" {%0A      + arn                = (known after apply)%0A      + id                 = (known after apply)%0A      + name               = "sample_scale_down"%0A      + policy_type        = "StepScaling"%0A      + resource_id        = "service/sample-cluster/sample-service"%0A      + scalable_dimension = "ecs:service:DesiredCount"%0A      + service_namespace  = "ecs"%0A%0A      + step_scaling_policy_configuration {%0A          + adjustment_type         = "ChangeInCapacity"%0A          + cooldown                = 60%0A          + metric_aggregation_type = "Maximum"%0A%0A          + step_adjustment {%0A              + metric_interval_upper_bound = "0"%0A              + scaling_adjustment          = -1%0A            }%0A        }%0A    }%0A%0A  # aws_appautoscaling_policy.up[0] will be created%0A  + resource "aws_appautoscaling_policy" "up" {%0A      + arn                = (known after apply)%0A      + id                 = (known after apply)%0A      + name               = "sample_scale_up"%0A      + policy_type        = "StepScaling"%0A      + resource_id        = "service/sample-cluster/sample-service"%0A      + scalable_dimension = "ecs:service:DesiredCount"%0A      + service_namespace  = "ecs"%0A%0A      + step_scaling_policy_configuration {%0A          + adjustment_type         = "ChangeInCapacity"%0A          + cooldown                = 60%0A          + metric_aggregation_type = "Maximum"%0A%0A          + step_adjustment {%0A              + metric_interval_lower_bound = "0"%0A              + scaling_adjustment          = 1%0A            }%0A        }%0A    }%0A%0A  # aws_appautoscaling_target.target[0] will be created%0A  + resource "aws_appautoscaling_target" "target" {%0A      + id                 = (known after apply)%0A      + max_capacity       = 6%0A      + min_capacity       = 1%0A      + resource_id        = "service/sample-cluster/sample-service"%0A      + role_arn           = (known after apply)%0A      + scalable_dimension = "ecs:service:DesiredCount"%0A      + service_namespace  = "ecs"%0A    }%0A%0A  # aws_budgets_budget.cost will be updated in-place%0A  ~ resource "aws_budgets_budget" "cost" {%0A        id                = "750307557100:startup-sample-monthly"%0A        name              = "startup-sample-monthly"%0A      ~ time_period_start = "2022-07-01_12:00" -> (known after apply)%0A        # (8 unchanged attributes hidden)%0A%0A%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # aws_cloudwatch_metric_alarm.service_cpu_high[0] will be updated in-place%0A  ~ resource "aws_cloudwatch_metric_alarm" "service_cpu_high" {%0A      ~ alarm_actions             = [] -> (known after apply)%0A        id                        = "sample_cpu_utilization_high"%0A        tags                      = {%0A            "Application" = "Startup Sample"%0A        }%0A        # (16 unchanged attributes hidden)%0A    }%0A%0A  # aws_cloudwatch_metric_alarm.service_cpu_low[0] will be updated in-place%0A  ~ resource "aws_cloudwatch_metric_alarm" "service_cpu_low" {%0A      ~ alarm_actions             = [] -> (known after apply)%0A        id                        = "sample_cpu_utilization_low"%0A        tags                      = {%0A            "Application" = "Startup Sample"%0A        }%0A        # (16 unchanged attributes hidden)%0A    }%0A%0A  # aws_ecs_cluster.main will be created%0A  + resource "aws_ecs_cluster" "main" {%0A      + arn                = (known after apply)%0A      + capacity_providers = [%0A          + "FARGATE_SPOT",%0A        ]%0A      + id                 = (known after apply)%0A      + name               = "sample-cluster"%0A      + tags               = {%0A          + "Application" = "Startup Sample"%0A        }%0A      + tags_all           = {%0A          + "Application" = "Startup Sample"%0A        }%0A%0A      + default_capacity_provider_strategy {%0A          + capacity_provider = "FARGATE_SPOT"%0A          + weight            = 100%0A        }%0A%0A      + setting {%0A          + name  = (known after apply)%0A          + value = (known after apply)%0A        }%0A    }%0A%0A  # aws_ecs_service.main[0] will be created%0A  + resource "aws_ecs_service" "main" {%0A      + cluster                            = (known after apply)%0A      + deployment_maximum_percent         = 200%0A      + deployment_minimum_healthy_percent = 100%0A      + desired_count                      = 2%0A      + enable_ecs_managed_tags            = true%0A      + enable_execute_command             = false%0A      + health_check_grace_period_seconds  = 60%0A      + iam_role                           = (known after apply)%0A      + id                                 = (known after apply)%0A      + launch_type                        = (known after apply)%0A      + name                               = "sample-service"%0A      + platform_version                   = (known after apply)%0A      + propagate_tags                     = "TASK_DEFINITION"%0A      + scheduling_strategy                = "REPLICA"%0A      + tags                               = {%0A          + "Application" = "Startup Sample"%0A        }%0A      + tags_all                           = {%0A          + "Application" = "Startup Sample"%0A        }%0A      + task_definition                    = (known after apply)%0A      + wait_for_steady_state              = false%0A%0A      + capacity_provider_strategy {%0A          + capacity_provider = "FARGATE_SPOT"%0A          + weight            = 100%0A        }%0A%0A      + load_balancer {%0A          + container_name   = "sample-client-app"%0A          + container_port   = 80%0A          + target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:750307557100:targetgroup/sample-target-group/e3d83ce273e376e7"%0A        }%0A%0A      + network_configuration {%0A          + assign_public_ip = false%0A          + security_groups  = [%0A              + "sg-0d08b3e5d27504d2e",%0A            ]%0A          + subnets          = [%0A              + "subnet-048e25be105ae01d3",%0A              + "subnet-0896ff158c3ecdc53",%0A            ]%0A        }%0A    }%0A%0A  # aws_ecs_task_definition.app[0] will be created%0A  + resource "aws_ecs_task_definition" "app" {%0A      + arn                      = (known after apply)%0A      + container_definitions    = jsonencode(%0A            [%0A              + {%0A                  + cpu              = 512%0A                  + environment      = [%0A                      + {%0A                          + name  = "AWS_REGION"%0A                          + value = "ca-central-1"%0A                        },%0A                      + {%0A                          + name  = "DB_NAME"%0A                          + value = "ssp-greetings"%0A                        },%0A                      + {%0A                          + name  = "bucketName"%0A                          + value = "upload-bucket-easy-longhorn"%0A                        },%0A                    ]%0A                  + essential        = true%0A                  + image            = "646101433301.dkr.ecr.ca-central-1.amazonaws.com/ssp:0f041e896cc2d18e5decf66ac4a020d4ffb8bd42"%0A                  + logConfiguration = {%0A                      + logDriver = "awslogs"%0A                      + options   = {%0A                          + awslogs-create-group  = "true"%0A                          + awslogs-group         = "/ecs/sample-app"%0A                          + awslogs-region        = "ca-central-1"%0A                          + awslogs-stream-prefix = "ecs"%0A                        }%0A                    }%0A                  + memory           = 1024%0A                  + mountPoints      = []%0A                  + name             = "sample-client-app"%0A                  + portMappings     = [%0A                      + {%0A                          + containerPort = 80%0A                          + hostPort      = 80%0A                          + protocol      = "tcp"%0A                        },%0A                    ]%0A                  + volumesFrom      = []%0A                },%0A            ]%0A        )%0A      + cpu                      = "512"%0A      + execution_role_arn       = "arn:aws:iam::750307557100:role/startupSampleEcsTaskExecutionRole"%0A      + family                   = "sample-app-task"%0A      + id                       = (known after apply)%0A      + memory                   = "1024"%0A      + network_mode             = "awsvpc"%0A      + requires_compatibilities = [%0A          + "FARGATE",%0A        ]%0A      + revision                 = (known after apply)%0A      + skip_destroy             = false%0A      + tags                     = {%0A          + "Application" = "Startup Sample"%0A        }%0A      + tags_all                 = {%0A          + "Application" = "Startup Sample"%0A        }%0A      + task_role_arn            = "arn:aws:iam::750307557100:role/sample_app_container_role"%0A    }%0A%0APlan: 6 to add, 3 to change, 0 to destroy.%0A╷%0A│ Warning: Argument is deprecated%0A│ %0A│   with aws_budgets_budget.cost,%0A│   on budget.tf line 19, in resource "aws_budgets_budget" "cost":%0A│   19:   cost_filters = {%0A│   20:     TagKeyValue = "user:Project$Startup Sample"%0A│   21:   }%0A│ %0A│ Use the attribute "cost_filter" instead.%0A│ %0A│ (and 7 more similar warnings elsewhere)%0A╵%0A╷%0A│ Warning: Deprecated Resource%0A│ %0A│   with module.network.data.aws_subnet_ids.web,%0A│   on .terraform/modules/network/main.tf line 31, in data "aws_subnet_ids" "web":%0A│   31: data "aws_subnet_ids" "web" {%0A│ %0A│ The aws_subnet_ids data source has been deprecated and will be removed in a%0A│ future version. Use the aws_subnets data source instead.%0A│ %0A│ (and 5 more similar warnings elsewhere)%0A╵%0A%0A------------------------------------------------------------------------%0A%0ACost estimation:%0A%0AResources: 3 of 5 estimated%0A           $1.180320000000000144/mo +$0.0%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::Running plan in the remote backend. Output will stream here. Pressing Ctrl-C%0Awill stop streaming the logs, but will not stop the plan running remotely.%0A%0APreparing the remote plan...%0A%0ATo view this run in a browser, visit:%0Ahttps://app.terraform.io/app/bcgov/cey5wq-dev/runs/run-hAWTadNKgHt3ELae%0A%0AWaiting for the plan to start...%0A%0ATerraform v1.1.9%0Aon linux_amd64%0AInitializing plugins and modules...%0Arandom_integer.cf_origin_id: Refreshing state... [id=2]%0Arandom_pet.upload_bucket_name: Refreshing state... [id=upload-bucket-easy-longhorn]%0Aaws_iam_role.sample_app_container_role: Refreshing state... [id=sample_app_container_role]%0Aaws_sns_topic.billing_alert_topic: Refreshing state... [id=arn:aws:sns:ca-central-1:750307557100:startup-sample-billing-alert-topic]%0Aaws_dynamodb_table.startup_sample_table: Refreshing state... [id=ssp-greetings]%0Aaws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ca-central-1:750307557100:cluster/sample-cluster]%0Aaws_cloudfront_distribution.geofencing[0]: Refreshing state... [id=E2V9IG3QAA0ZBA]%0Aaws_s3_bucket.upload_bucket: Refreshing state... [id=upload-bucket-easy-longhorn]%0Aaws_iam_role.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole]%0Aaws_budgets_budget.cost: Refreshing state... [id=750307557100:startup-sample-monthly]%0Aaws_security_group.ecs_tasks: Refreshing state... [id=sg-0d08b3e5d27504d2e]%0Aaws_alb_target_group.app: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:750307557100:targetgroup/sample-target-group/e3d83ce273e376e7]%0Aaws_lb_listener_rule.host_based_weighted_routing: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:750307557100:listener-rule/app/default/0c809176c7c1df62/4fe72b37b89fbe83/61da53327c562b23]%0Aaws_iam_role_policy.sample_app_container_cwlogs: Refreshing state... [id=sample_app_container_role:sample_app_container_cwlogs]%0Aaws_iam_role_policy.sample_app_dynamodb: Refreshing state... [id=sample_app_container_role:sample_app_dynamodb]%0Aaws_iam_role_policy.ssp_bucket_policy: Refreshing state... [id=sample_app_container_role:upload_bucket_policy]%0Aaws_iam_role_policy.ecs_task_execution_cwlogs: Refreshing state... [id=startupSampleEcsTaskExecutionRole:ecs_task_execution_cwlogs]%0Aaws_iam_role_policy_attachment.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole-20220712182416110200000002]%0Aaws_ecs_task_definition.app[0]: Refreshing state... [id=sample-app-task]%0Aaws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:ca-central-1:750307557100:service/sample-cluster/sample-service]%0Aaws_appautoscaling_target.target[0]: Refreshing state... [id=service/sample-cluster/sample-service]%0Aaws_appautoscaling_policy.up[0]: Refreshing state... [id=sample_scale_up]%0Aaws_appautoscaling_policy.down[0]: Refreshing state... [id=sample_scale_down]%0Aaws_cloudwatch_metric_alarm.service_cpu_high[0]: Refreshing state... [id=sample_cpu_utilization_high]%0Aaws_cloudwatch_metric_alarm.service_cpu_low[0]: Refreshing state... [id=sample_cpu_utilization_low]%0A%0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply":%0A%0A  # aws_appautoscaling_policy.down[0] has been deleted%0A  - resource "aws_appautoscaling_policy" "down" {%0A      - arn                = "arn:aws:autoscaling:ca-central-1:750307557100:scalingPolicy:1171a12f-0612-4729-9011-c8993da2b02d:resource/ecs/service/sample-cluster/sample-service:policyName/sample_scale_down" -> null%0A      - id                 = "sample_scale_down" -> null%0A      - name               = "sample_scale_down" -> null%0A      - policy_type        = "StepScaling" -> null%0A      - resource_id        = "service/sample-cluster/sample-service" -> null%0A      - scalable_dimension = "ecs:service:DesiredCount" -> null%0A      - service_namespace  = "ecs" -> null%0A%0A      - step_scaling_policy_configuration {%0A          - adjustment_type          = "ChangeInCapacity" -> null%0A          - cooldown                 = 60 -> null%0A          - metric_aggregation_type  = "Maximum" -> null%0A          - min_adjustment_magnitude = 0 -> null%0A%0A          - step_adjustment {%0A              - metric_interval_upper_bound = "0" -> null%0A              - scaling_adjustment          = -1 -> null%0A            }%0A        }%0A    }%0A%0A  # aws_appautoscaling_policy.up[0] has been deleted%0A  - resource "aws_appautoscaling_policy" "up" {%0A      - arn                = "arn:aws:autoscaling:ca-central-1:750307557100:scalingPolicy:1171a12f-0612-4729-9011-c8993da2b02d:resource/ecs/service/sample-cluster/sample-service:policyName/sample_scale_up" -> null%0A      - id                 = "sample_scale_up" -> null%0A      - name               = "sample_scale_up" -> null%0A      - policy_type        = "StepScaling" -> null%0A      - resource_id        = "service/sample-cluster/sample-service" -> null%0A      - scalable_dimension = "ecs:service:DesiredCount" -> null%0A      - service_namespace  = "ecs" -> null%0A%0A      - step_scaling_policy_configuration {%0A          - adjustment_type          = "ChangeInCapacity" -> null%0A          - cooldown                 = 60 -> null%0A          - metric_aggregation_type  = "Maximum" -> null%0A          - min_adjustment_magnitude = 0 -> null%0A%0A          - step_adjustment {%0A              - metric_interval_lower_bound = "0" -> null%0A              - scaling_adjustment          = 1 -> null%0A            }%0A        }%0A    }%0A%0A  # aws_appautoscaling_target.target[0] has been deleted%0A  - resource "aws_appautoscaling_target" "target" {%0A      - id                 = "service/sample-cluster/sample-service" -> null%0A      - max_capacity       = 6 -> null%0A      - min_capacity       = 1 -> null%0A      - resource_id        = "service/sample-cluster/sample-service" -> null%0A      - role_arn           = "arn:aws:iam::750307557100:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> null%0A      - scalable_dimension = "ecs:service:DesiredCount" -> null%0A      - service_namespace  = "ecs" -> null%0A    }%0A%0A  # aws_cloudfront_distribution.geofencing[0] has changed%0A  ~ resource "aws_cloudfront_distribution" "geofencing" {%0A      + aliases                        = []%0A        id                             = "E2V9IG3QAA0ZBA"%0A        tags                           = {%0A            "Application" = "Startup Sample"%0A        }%0A        # (18 unchanged attributes hidden)%0A%0A%0A      ~ ordered_cache_behavior {%0A          + trusted_key_groups     = []%0A          + trusted_signers        = []%0A            # (10 unchanged attributes hidden)%0A%0A          ~ forwarded_values {%0A                # (3 unchanged attributes hidden)%0A%0A              ~ cookies {%0A                  + whitelisted_names = []%0A                    # (1 unchanged attribute hidden)%0A                }%0A            }%0A        }%0A%0A%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # aws_cloudwatch_metric_alarm.service_cpu_high[0] has changed%0A  ~ resource "aws_cloudwatch_metric_alarm" "service_cpu_high" {%0A      ~ alarm_actions             = [%0A          - "arn:aws:autoscaling:ca-central-1:750307557100:scalingPolicy:1171a12f-0612-4729-9011-c8993da2b02d:resource/ecs/service/sample-cluster/sample-service:policyName/sample_scale_up",%0A        ]%0A        id                        = "sample_cpu_utilization_high"%0A      + insufficient_data_actions = []%0A      + ok_actions                = []%0A        tags                      = {%0A            "Application" = "Startup Sample"%0A        }%0A        # (14 unchanged attributes hidden)%0A    }%0A%0A  # aws_cloudwatch_metric_alarm.service_cpu_low[0] has changed%0A  ~ resource "aws_cloudwatch_metric_alarm" "service_cpu_low" {%0A      ~ alarm_actions             = [%0A          - "arn:aws:autoscaling:ca-central-1:750307557100:scalingPolicy:1171a12f-0612-4729-9011-c8993da2b02d:resource/ecs/service/sample-cluster/sample-service:policyName/sample_scale_down",%0A        ]%0A        id                        = "sample_cpu_utilization_low"%0A      + insufficient_data_actions = []%0A      + ok_actions                = []%0A        tags                      = {%0A            "Application" = "Startup Sample"%0A        }%0A        # (14 unchanged attributes hidden)%0A    }%0A%0A  # aws_ecs_cluster.main has been deleted%0A  - resource "aws_ecs_cluster" "main" {%0A      - arn                = "arn:aws:ecs:ca-central-1:750307557100:cluster/sample-cluster" -> null%0A      - capacity_providers = [%0A          - "FARGATE_SPOT",%0A        ] -> null%0A      - id                 = "arn:aws:ecs:ca-central-1:750307557100:cluster/sample-cluster" -> null%0A      - name               = "sample-cluster" -> null%0A      - tags               = {%0A          - "Application" = "Startup Sample"%0A        } -> null%0A      - tags_all           = {%0A          - "Application" = "Startup Sample"%0A        } -> null%0A%0A      - default_capacity_provider_strategy {%0A          - capacity_provider = "FARGATE_SPOT" -> null%0A          - weight            = 100 -> null%0A        }%0A%0A      - setting {%0A          - name  = "containerInsights" -> null%0A          - value = "disabled" -> null%0A        }%0A    }%0A%0A  # aws_ecs_service.main[0] has been deleted%0A  - resource "aws_ecs_service" "main" {%0A      - cluster                            = "arn:aws:ecs:ca-central-1:750307557100:cluster/sample-cluster" -> null%0A      - deployment_maximum_percent         = 200 -> null%0A      - deployment_minimum_healthy_percent = 100 -> null%0A      - desired_count                      = 2 -> null%0A      - enable_ecs_managed_tags            = true -> null%0A      - enable_execute_command             = false -> null%0A      - health_check_grace_period_seconds  = 60 -> null%0A      - iam_role                           = "aws-service-role" -> null%0A      - id                                 = "arn:aws:ecs:ca-central-1:750307557100:service/sample-cluster/sample-service" -> null%0A      - name                               = "sample-service" -> null%0A      - platform_version                   = "LATEST" -> null%0A      - propagate_tags                     = "TASK_DEFINITION" -> null%0A      - scheduling_strategy                = "REPLICA" -> null%0A      - tags                               = {%0A          - "Application" = "Startup Sample"%0A        } -> null%0A      - tags_all                           = {%0A          - "Application" = "Startup Sample"%0A        } -> null%0A      - task_definition                    = "arn:aws:ecs:ca-central-1:750307557100:task-definition/sample-app-task:2" -> null%0A      - wait_for_steady_state              = false -> null%0A%0A      - capacity_provider_strategy {%0A          - capacity_provider = "FARGATE_SPOT" -> null%0A          - weight            = 100 -> null%0A        }%0A%0A      - deployment_circuit_breaker {%0A          - enable   = false -> null%0A          - rollback = false -> null%0A        }%0A%0A      - deployment_controller {%0A          - type = "ECS" -> null%0A        }%0A%0A      - load_balancer {%0A          - container_name   = "sample-client-app" -> null%0A          - container_port   = 80 -> null%0A          - target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:750307557100:targetgroup/sample-target-group/e3d83ce273e376e7" -> null%0A        }%0A%0A      - network_configuration {%0A          - assign_public_ip = false -> null%0A          - security_groups  = [%0A              - "sg-0d08b3e5d27504d2e",%0A            ] -> null%0A          - subnets          = [%0A              - "subnet-048e25be105ae01d3",%0A              - "subnet-0896ff158c3ecdc53",%0A            ] -> null%0A        }%0A    }%0A%0A  # aws_ecs_task_definition.app[0] has been deleted%0A  - resource "aws_ecs_task_definition" "app" {%0A      - arn                      = "arn:aws:ecs:ca-central-1:750307557100:task-definition/sample-app-task:2" -> null%0A      - container_definitions    = jsonencode(%0A            [%0A              - {%0A                  - cpu              = 512%0A                  - environment      = [%0A                      - {%0A                          - name  = "AWS_REGION"%0A                          - value = "ca-central-1"%0A                        },%0A                      - {%0A                          - name  = "DB_NAME"%0A                          - value = "ssp-greetings"%0A                        },%0A                      - {%0A                          - name  = "bucketName"%0A                          - value = "upload-bucket-easy-longhorn"%0A                        },%0A                    ]%0A                  - essential        = true%0A                  - image            = "646101433301.dkr.ecr.ca-central-1.amazonaws.com/ssp:d46a1d09713ee116abb6dc183c37a3af330218df"%0A                  - logConfiguration = {%0A                      - logDriver = "awslogs"%0A                      - options   = {%0A                          - awslogs-create-group  = "true"%0A                          - awslogs-group         = "/ecs/sample-app"%0A                          - awslogs-region        = "ca-central-1"%0A                          - awslogs-stream-prefix = "ecs"%0A                        }%0A                    }%0A                  - memory           = 1024%0A                  - mountPoints      = []%0A                  - name             = "sample-client-app"%0A                  - portMappings     = [%0A                      - {%0A                          - containerPort = 80%0A                          - hostPort      = 80%0A                          - protocol      = "tcp"%0A                        },%0A                    ]%0A                  - volumesFrom      = []%0A                },%0A            ]%0A        ) -> null%0A      - cpu                      = "512" -> null%0A      - execution_role_arn       = "arn:aws:iam::750307557100:role/startupSampleEcsTaskExecutionRole" -> null%0A      - family                   = "sample-app-task" -> null%0A      - id                       = "sample-app-task" -> null%0A      - memory                   = "1024" -> null%0A      - network_mode             = "awsvpc" -> null%0A      - requires_compatibilities = [%0A          - "FARGATE",%0A        ] -> null%0A      - revision                 = 2 -> null%0A      - skip_destroy             = false -> null%0A      - tags                     = {%0A          - "Application" = "Startup Sample"%0A        } -> null%0A      - tags_all                 = {%0A          - "Application" = "Startup Sample"%0A        } -> null%0A      - task_role_arn            = "arn:aws:iam::750307557100:role/sample_app_container_role" -> null%0A    }%0A%0A  # aws_iam_role.ecs_task_execution_role has changed%0A  ~ resource "aws_iam_role" "ecs_task_execution_role" {%0A        id                    = "startupSampleEcsTaskExecutionRole"%0A      ~ managed_policy_arns   = [%0A          + "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",%0A        ]%0A        name                  = "startupSampleEcsTaskExecutionRole"%0A        tags                  = {%0A            "Application" = "Startup Sample"%0A        }%0A        # (8 unchanged attributes hidden)%0A%0A      - inline_policy {}%0A      + inline_policy {%0A          + name   = "ecs_task_execution_cwlogs"%0A          + policy = jsonencode(%0A                {%0A                  + Statement = [%0A                      + {%0A                          + Action   = [%0A                              + "logs:CreateLogGroup",%0A                            ]%0A                          + Effect   = "Allow"%0A                          + Resource = [%0A                              + "arn:aws:logs:*:*:*",%0A                            ]%0A                        },%0A                    ]%0A                  + Version   = "2012-10-17"%0A                }%0A            )%0A        }%0A    }%0A%0A  # aws_iam_role.sample_app_container_role has changed%0A  ~ resource "aws_iam_role" "sample_app_container_role" {%0A        id                    = "sample_app_container_role"%0A        name                  = "sample_app_container_role"%0A        tags                  = {%0A            "Application" = "Startup Sample"%0A        }%0A        # (9 unchanged attributes hidden)%0A%0A      - inline_policy {}%0A      + inline_policy {%0A          + name   = "sample_app_container_cwlogs"%0A          + policy = jsonencode(%0A                {%0A                  + Statement = [%0A                      + {%0A                          + Action   = [%0A                              + "logs:CreateLogGroup",%0A                              + "logs:CreateLogStream",%0A                              + "logs:PutLogEvents",%0A                              + "logs:DescribeLogStreams",%0A                            ]%0A                          + Effect   = "Allow"%0A                          + Resource = [%0A                              + "arn:aws:logs:*:*:*",%0A                            ]%0A                        },%0A                    ]%0A                  + Version   = "2012-10-17"%0A                }%0A            )%0A        }%0A      + inline_policy {%0A          + name   = "sample_app_dynamodb"%0A          + policy = jsonencode(%0A                {%0A                  + Statement = [%0A                      + {%0A                          + Action   = [%0A                              + "dynamodb:BatchGet*",%0A                              + "dynamodb:DescribeStream",%0A                              + "dynamodb:DescribeTable",%0A                              + "dynamodb:Get*",%0A                              + "dynamodb:Query",%0A                              + "dynamodb:Scan",%0A                              + "dynamodb:BatchWrite*",%0A                              + "dynamodb:CreateTable",%0A                              + "dynamodb:Delete*",%0A                              + "dynamodb:Update*",%0A                              + "dynamodb:PutItem",%0A                            ]%0A                          + Effect   = "Allow"%0A                          + Resource = "arn:aws:dynamodb:ca-central-1:750307557100:table/ssp-greetings"%0A                        },%0A                    ]%0A                  + Version   = "2012-10-17"%0A                }%0A            )%0A        }%0A      + inline_policy {%0A          + name   = "upload_bucket_policy"%0A          + policy = jsonencode(%0A                {%0A                  + Statement = [%0A                      + {%0A                          + Action   = [%0A                              + "s3:PutObject",%0A                              + "s3:GetObject",%0A                              + "kms:Decrypt",%0A                              + "kms:Encrypt",%0A                              + "s3:PutBucketCORS",%0A                            ]%0A                          + Effect   = "Allow"%0A                          + Resource = [%0A                              + "arn:aws:s3:::upload-bucket-easy-longhorn",%0A                              + "arn:aws:s3:::upload-bucket-easy-longhorn/*",%0A                              + "arn:aws:kms:*:750307557100:key/*",%0A                            ]%0A                        },%0A                    ]%0A                  + Version   = "2012-10-17"%0A                }%0A            )%0A        }%0A    }%0A%0A  # aws_lb_listener_rule.host_based_weighted_routing has changed%0A  ~ resource "aws_lb_listener_rule" "host_based_weighted_routing" {%0A        id           = "arn:aws:elasticloadbalancing:ca-central-1:750307557100:listener-rule/app/default/0c809176c7c1df62/4fe72b37b89fbe83/61da53327c562b23"%0A      + tags         = {}%0A        # (4 unchanged attributes hidden)%0A%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # aws_s3_bucket.upload_bucket has changed%0A  ~ resource "aws_s3_bucket" "upload_bucket" {%0A        id                          = "upload-bucket-easy-longhorn"%0A      + tags                        = {}%0A        # (11 unchanged attributes hidden)%0A%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # aws_sns_topic.billing_alert_topic has changed%0A  ~ resource "aws_sns_topic" "billing_alert_topic" {%0A        id                                       = "arn:aws:sns:ca-central-1:750307557100:startup-sample-billing-alert-topic"%0A        name                                     = "startup-sample-billing-alert-topic"%0A      + tags                                     = {}%0A        # (11 unchanged attributes hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # aws_appautoscaling_policy.down[0] will be created%0A  + resource "aws_appautoscaling_policy" "down" {%0A      + arn                = (known after apply)%0A      + id                 = (known after apply)%0A      + name               = "sample_scale_down"%0A      + policy_type        = "StepScaling"%0A      + resource_id        = "service/sample-cluster/sample-service"%0A      + scalable_dimension = "ecs:service:DesiredCount"%0A      + service_namespace  = "ecs"%0A%0A      + step_scaling_policy_configuration {%0A          + adjustment_type         = "ChangeInCapacity"%0A          + cooldown                = 60%0A          + metric_aggregation_type = "Maximum"%0A%0A          + step_adjustment {%0A              + metric_interval_upper_bound = "0"%0A              + scaling_adjustment          = -1%0A            }%0A        }%0A    }%0A%0A  # aws_appautoscaling_policy.up[0] will be created%0A  + resource "aws_appautoscaling_policy" "up" {%0A      + arn                = (known after apply)%0A      + id                 = (known after apply)%0A      + name               = "sample_scale_up"%0A      + policy_type        = "StepScaling"%0A      + resource_id        = "service/sample-cluster/sample-service"%0A      + scalable_dimension = "ecs:service:DesiredCount"%0A      + service_namespace  = "ecs"%0A%0A      + step_scaling_policy_configuration {%0A          + adjustment_type         = "ChangeInCapacity"%0A          + cooldown                = 60%0A          + metric_aggregation_type = "Maximum"%0A%0A          + step_adjustment {%0A              + metric_interval_lower_bound = "0"%0A              + scaling_adjustment          = 1%0A            }%0A        }%0A    }%0A%0A  # aws_appautoscaling_target.target[0] will be created%0A  + resource "aws_appautoscaling_target" "target" {%0A      + id                 = (known after apply)%0A      + max_capacity       = 6%0A      + min_capacity       = 1%0A      + resource_id        = "service/sample-cluster/sample-service"%0A      + role_arn           = (known after apply)%0A      + scalable_dimension = "ecs:service:DesiredCount"%0A      + service_namespace  = "ecs"%0A    }%0A%0A  # aws_budgets_budget.cost will be updated in-place%0A  ~ resource "aws_budgets_budget" "cost" {%0A        id                = "750307557100:startup-sample-monthly"%0A        name              = "startup-sample-monthly"%0A      ~ time_period_start = "2022-07-01_12:00" -> (known after apply)%0A        # (8 unchanged attributes hidden)%0A%0A%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # aws_cloudwatch_metric_alarm.service_cpu_high[0] will be updated in-place%0A  ~ resource "aws_cloudwatch_metric_alarm" "service_cpu_high" {%0A      ~ alarm_actions             = [] -> (known after apply)%0A        id                        = "sample_cpu_utilization_high"%0A        tags                      = {%0A            "Application" = "Startup Sample"%0A        }%0A        # (16 unchanged attributes hidden)%0A    }%0A%0A  # aws_cloudwatch_metric_alarm.service_cpu_low[0] will be updated in-place%0A  ~ resource "aws_cloudwatch_metric_alarm" "service_cpu_low" {%0A      ~ alarm_actions             = [] -> (known after apply)%0A        id                        = "sample_cpu_utilization_low"%0A        tags                      = {%0A            "Application" = "Startup Sample"%0A        }%0A        # (16 unchanged attributes hidden)%0A    }%0A%0A  # aws_ecs_cluster.main will be created%0A  + resource "aws_ecs_cluster" "main" {%0A      + arn                = (known after apply)%0A      + capacity_providers = [%0A          + "FARGATE_SPOT",%0A        ]%0A      + id                 = (known after apply)%0A      + name               = "sample-cluster"%0A      + tags               = {%0A          + "Application" = "Startup Sample"%0A        }%0A      + tags_all           = {%0A          + "Application" = "Startup Sample"%0A        }%0A%0A      + default_capacity_provider_strategy {%0A          + capacity_provider = "FARGATE_SPOT"%0A          + weight            = 100%0A        }%0A%0A      + setting {%0A          + name  = (known after apply)%0A          + value = (known after apply)%0A        }%0A    }%0A%0A  # aws_ecs_service.main[0] will be created%0A  + resource "aws_ecs_service" "main" {%0A      + cluster                            = (known after apply)%0A      + deployment_maximum_percent         = 200%0A      + deployment_minimum_healthy_percent = 100%0A      + desired_count                      = 2%0A      + enable_ecs_managed_tags            = true%0A      + enable_execute_command             = false%0A      + health_check_grace_period_seconds  = 60%0A      + iam_role                           = (known after apply)%0A      + id                                 = (known after apply)%0A      + launch_type                        = (known after apply)%0A      + name                               = "sample-service"%0A      + platform_version                   = (known after apply)%0A      + propagate_tags                     = "TASK_DEFINITION"%0A      + scheduling_strategy                = "REPLICA"%0A      + tags                               = {%0A          + "Application" = "Startup Sample"%0A        }%0A      + tags_all                           = {%0A          + "Application" = "Startup Sample"%0A        }%0A      + task_definition                    = (known after apply)%0A      + wait_for_steady_state              = false%0A%0A      + capacity_provider_strategy {%0A          + capacity_provider = "FARGATE_SPOT"%0A          + weight            = 100%0A        }%0A%0A      + load_balancer {%0A          + container_name   = "sample-client-app"%0A          + container_port   = 80%0A          + target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:750307557100:targetgroup/sample-target-group/e3d83ce273e376e7"%0A        }%0A%0A      + network_configuration {%0A          + assign_public_ip = false%0A          + security_groups  = [%0A              + "sg-0d08b3e5d27504d2e",%0A            ]%0A          + subnets          = [%0A              + "subnet-048e25be105ae01d3",%0A              + "subnet-0896ff158c3ecdc53",%0A            ]%0A        }%0A    }%0A%0A  # aws_ecs_task_definition.app[0] will be created%0A  + resource "aws_ecs_task_definition" "app" {%0A      + arn                      = (known after apply)%0A      + container_definitions    = jsonencode(%0A            [%0A              + {%0A                  + cpu              = 512%0A                  + environment      = [%0A                      + {%0A                          + name  = "AWS_REGION"%0A                          + value = "ca-central-1"%0A                        },%0A                      + {%0A                          + name  = "DB_NAME"%0A                          + value = "ssp-greetings"%0A                        },%0A                      + {%0A                          + name  = "bucketName"%0A                          + value = "upload-bucket-easy-longhorn"%0A                        },%0A                    ]%0A                  + essential        = true%0A                  + image            = "646101433301.dkr.ecr.ca-central-1.amazonaws.com/ssp:0f041e896cc2d18e5decf66ac4a020d4ffb8bd42"%0A                  + logConfiguration = {%0A                      + logDriver = "awslogs"%0A                      + options   = {%0A                          + awslogs-create-group  = "true"%0A                          + awslogs-group         = "/ecs/sample-app"%0A                          + awslogs-region        = "ca-central-1"%0A                          + awslogs-stream-prefix = "ecs"%0A                        }%0A                    }%0A                  + memory           = 1024%0A                  + mountPoints      = []%0A                  + name             = "sample-client-app"%0A                  + portMappings     = [%0A                      + {%0A                          + containerPort = 80%0A                          + hostPort      = 80%0A                          + protocol      = "tcp"%0A                        },%0A                    ]%0A                  + volumesFrom      = []%0A                },%0A            ]%0A        )%0A      + cpu                      = "512"%0A      + execution_role_arn       = "arn:aws:iam::750307557100:role/startupSampleEcsTaskExecutionRole"%0A      + family                   = "sample-app-task"%0A      + id                       = (known after apply)%0A      + memory                   = "1024"%0A      + network_mode             = "awsvpc"%0A      + requires_compatibilities = [%0A          + "FARGATE",%0A        ]%0A      + revision                 = (known after apply)%0A      + skip_destroy             = false%0A      + tags                     = {%0A          + "Application" = "Startup Sample"%0A        }%0A      + tags_all                 = {%0A          + "Application" = "Startup Sample"%0A        }%0A      + task_role_arn            = "arn:aws:iam::750307557100:role/sample_app_container_role"%0A    }%0A%0APlan: 6 to add, 3 to change, 0 to destroy.%0A╷%0A│ Warning: Argument is deprecated%0A│ %0A│   with aws_budgets_budget.cost,%0A│   on budget.tf line 19, in resource "aws_budgets_budget" "cost":%0A│   19:   cost_filters = {%0A│   20:     TagKeyValue = "user:Project$Startup Sample"%0A│   21:   }%0A│ %0A│ Use the attribute "cost_filter" instead.%0A│ %0A│ (and 7 more similar warnings elsewhere)%0A╵%0A╷%0A│ Warning: Deprecated Resource%0A│ %0A│   with module.network.data.aws_subnet_ids.web,%0A│   on .terraform/modules/network/main.tf line 31, in data "aws_subnet_ids" "web":%0A│   31: data "aws_subnet_ids" "web" {%0A│ %0A│ The aws_subnet_ids data source has been deprecated and will be removed in a%0A│ future version. Use the aws_subnets data source instead.%0A│ %0A│ (and 5 more similar warnings elsewhere)%0A╵%0A%0A------------------------------------------------------------------------%0A%0ACost estimation:%0A%0AResources: 3 of 5 estimated%0A           $1.180320000000000144/mo +$0.0%0A

::set-output name=stderr::

::set-output name=exitcode::0

```

</details>

#### Architecture Diagram

![img](null)

*Pusher:* @sharpedavid, *Action:* [Terraform Plan: #8](https://github.com/sharpedavid/startup-sample-project-aws-containers/actions/runs/2666714030)